Revit 2027 API
IExternalResourceUIServer.GetDBServerId Method
 Implement this method to return the id of the server which is associated with this UI server.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Guid GetDBServerId()
Function GetDBServerId As Guid
Guid GetDBServerId()
abstract GetDBServerId : unit -> Guid
Return Value
Guid
 The id of the associated DB server.
Remarks
 If there's no DB server associated with this UI server, an empty GUID value will be returned.
See Also
Reference
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace